import pymongo# Lab Assignment 7: Database Queries
## DS 6001: Practice and Application of Data Science

### Instructions
Please answer the following questions as completely as possible using text, code, and the results of code as needed. Format your answers in a Jupyter notebook. To receive full credit, make sure you address every part of the problem, and make sure your document is formatted in a clean and professional way.

### Problem 0
Import the following libraries, load the `.env` file where you store your passwords (see the notebook for module 4 for details), and turn off the error tracebacks to make errors easier to read:

In [366]:
import numpy as np
import pandas as pd
import sys
import os
import requests
import psycopg2
import pymongo # fixed the issue by https://stackoverflow.com/questions/12983472/flask-importerror-with-bson-on-os-x/46166075#46166075
import json
from bson.json_util import dumps, loads
from sqlalchemy import create_engine
import dotenv
import pymongo
from bson.json_util import dumps, loads
os.chdir("/Users/cory/Desktop/DS 6001/lab_4") # change to the directory where your .env file is
dotenv.load_dotenv() # register the .env file where passwords are stored
sys.tracebacklimit = 0 # turn off the error tracebacks

ERROR! Session/line number was not unique in database. History logging moved to new session 1165

### Problem 1
For this problem, we will be building a PostgreSQL database that contains the collected works of Shakespeare.

<img src="https://www.chappatte.com/prod/wp-content/uploads/artworks/2016/04/L160423ge-950x635.jpg" width="300">

The data were collected by [Catherine Devlin](https://github.com/catherinedevlin/opensourceshakespeare) from the repository at https://opensourceshakespeare.org/. The database will have four tables, one representing works by Shakespeare, one for characters that appear in Shakespeare's plays, one for chapters (this is, scenes within acts), and one for paragraphs (that is, lines of dialogue). The data to populate these four tables are here:

In [367]:
works = pd.read_csv("https://github.com/jkropko/DS-6001/raw/master/localdata/Works.csv")
characters = pd.read_csv("https://github.com/jkropko/DS-6001/raw/master/localdata/Characters.csv")
chapters = pd.read_csv("https://github.com/jkropko/DS-6001/raw/master/localdata/Chapters.csv")
paragraphs = pd.read_csv("https://github.com/jkropko/DS-6001/raw/master/localdata/Paragraphs.csv")

In PostgreSQL, it is best practice to convert all column names to lower-case, as case sensitive column names will require [extraneous double-quotes](https://stackoverflow.com/questions/20878932/are-postgresql-column-names-case-sensitive) in any query. We first convert the column names in all four dataframe to lowercase:

In [368]:
works.columns = works.columns.str.lower()
characters.columns = characters.columns.str.lower()
chapters.columns = chapters.columns.str.lower()
paragraphs.columns = paragraphs.columns.str.lower()

You will build a database and populate it with these data. The ER diagram for the database is:

<img src="https://github.com/jkropko/DS-6001/raw/master/localimages/shakespeare2.png" width="400">

There's no codebook, unfortunately, but the values in the columns are mostly self-explanatory:

In [369]:
works.head()

,workid,title,longtitle,date,genretype,notes,source,totalwords,totalparagraphs
0,12night,Twelfth Night,"Twelfth Night, Or What You Will",1599,c,NaN,Moby,19837,1031
1,allswell,All's Well That Ends Well,All's Well That Ends Well,1602,c,NaN,Moby,22997,1025
2,antonycleo,Antony and Cleopatra,Antony and Cleopatra,1606,t,NaN,Moby,24905,1344
3,asyoulikeit,As You Like It,As You Like It,1599,c,NaN,Gutenberg,21690,872
4,comedyerrors,Comedy of Errors,The Comedy of Errors,1589,c,NaN,Moby,14692,661

In [370]:
characters.head()

,charid,charname,abbrev,works,description,speechcount
0,1apparition-mac,First Apparition,First Apparition,macbeth,NaN,1.0
1,1citizen,First Citizen,First Citizen,romeojuliet,NaN,3.0
2,1conspirator,First Conspirator,First Conspirator,coriolanus,NaN,3.0
3,1gentleman-oth,First Gentleman,First Gentleman,othello,NaN,1.0
4,1goth,First Goth,First Goth,titus,NaN,4.0

In [371]:
chapters.head()

    workid  chapterid  section  chapter            description
0  12night    18704.0      1.0      1.0  DUKE ORSINO's palace.
1  12night    18705.0      1.0      2.0         The sea-coast.
2  12night    18706.0      1.0      3.0        OLIVIA'S house.
3  12night    18707.0      1.0      4.0  DUKE ORSINO's palace.
4  12night    18708.0      1.0      5.0        OLIVIA'S house.

In [372]:
paragraphs.head()

,workid,paragraphid,paragraphnum,charid,plaintext,phonetictext,stemtext,paragraphtype,section,chapter,charcount,wordcount
0,12night,630863,3,xxx,"[Enter DUKE ORSINO, CURIO, and other Lords; Mu...",ENTR TK ORSN KR ANT O0R LRTS MSXNS ATNTNK,enter duke orsino curio and other lord musicia...,b,1.0,1.0,65.0,9.0
1,12night,630864,4,ORSINO,"If music be the food of love, play on;\n[p]Giv...",IF MSK B 0 FT OF LF PL ON JF M EKSSS OF IT 0T ...,if music be the food of love plai on give me e...,b,1.0,1.0,646.0,114.0
2,12night,630865,19,CURIO,"Will you go hunt, my lord?\n",WL Y K HNT M LRT,will you go hunt my lord,b,1.0,1.0,27.0,6.0
3,12night,630866,20,ORSINO,"What, Curio?\n",HT KR,what curio,b,1.0,1.0,13.0,2.0
4,12night,630867,21,CURIO,The hart.\n,0 HRT,the hart,b,1.0,1.0,10.0,2.0

#### Part a
Connect to your local PostgreSQL server (take steps to hide your password!), create a new database for the Shakespeare data, use `create_engine()` from `sqlalchemy` to connect to the database, and create the works, characters, chapters, and paragraphs tables populated with the data from the four dataframes shown above. [2 points]

In [373]:
dotenv.load_dotenv()
pgpassword = os.getenv("pgpassword")

In [374]:
dbserver = psycopg2.connect(
    user='cory', 
    password=pgpassword, 
    host="localhost"
)
dbserver.autocommit = True

In [375]:
cursor = dbserver.cursor()

In [ ]:
try:
    cursor.execute("CREATE DATABASE lab7")
except:
    cursor.execute("DROP DATABASE lab7")
    cursor.execute("CREATE DATABASE lab7")

ERROR:root:Internal Python error in the inspect module.
Below is the traceback from this internal error.

ERROR:root:Internal Python error in the inspect module.
Below is the traceback from this internal error.

ERROR:root:Internal Python error in the inspect module.
Below is the traceback from this internal error.

Traceback (most recent call last):
psycopg2.errors.DuplicateDatabase: database "lab7" already exists


During handling of the above exception, another exception occurred:

Traceback (most recent call last):
psycopg2.errors.ObjectInUse: database "lab7" is being accessed by other users
DETAIL:  There are 2 other sessions using the database.


During handling of the above exception, another exception occurred:

Traceback (most recent call last):
AttributeError: 'ObjectInUse' object has no attribute '_render_traceback_'

During handling of the above exception, another exception occurred:

Traceback (most recent call last):
AssertionError
Traceback (most recent call last):
psycopg2.errors.DuplicateDatabase: database "lab7" already exists


During handling of the above exception, another exception occurred:

Traceback (most recent call last):
psycopg2.errors.ObjectInUse: database "lab7" is being accessed by other users
DETAIL:  There are 2 other sessions using the database.


During handling of the above exception, another exception occurred:

Traceback (most recent call last):
AttributeError: 'ObjectInUse' object has no attribute '_render_traceback_'

During handling of the above exception, another exception occurred:

Traceback (most recent call last):
TypeError: object of type 'NoneType' has no len()

During handling of the above exception, another exception occurred:

Traceback (most recent call last):
AttributeError: 'TypeError' object has no attribute '_render_traceback_'

During handling of the above exception, another exception occurred:

Traceback (most recent call last):
AssertionError
Traceback (most recent call last):
psycopg2.errors.DuplicateDatabase: database "lab7" already exists


During handling of the above exception, another exception occurred:

Traceback (most recent call last):
psycopg2.errors.ObjectInUse: database "lab7" is being accessed by other users
DETAIL:  There are 2 other sessions using the database.


During handling of the above exception, another exception occurred:

Traceback (most recent call last):
AttributeError: 'ObjectInUse' object has no attribute '_render_traceback_'

During handling of the above exception, another exception occurred:

Traceback (most recent call last):
TypeError: object of type 'NoneType' has no len()

During handling of the above exception, another exception occurred:

Traceback (most recent call last):
AttributeError: 'TypeError' object has no attribute '_render_traceback_'

During handling of the above exception, another exception occurred:

Traceback (most recent call last):
TypeError: object of type 'NoneType' has no len()

During handling of the above exception, another exception occurred:

Traceback (most recent call last):
AttributeError: 'TypeError' object has no attribute '_render_traceback_'

During handling of the above exception, another exception occurred:

Traceback (most recent call last):
AssertionError

In [376]:
lab7 = psycopg2.connect(
    user='cory', 
    password=pgpassword, 
    host="localhost",
    database="lab7"
)

ERROR! Session/line number was not unique in database. History logging moved to new session 1166

In [377]:
engine  = create_engine("postgresql+psycopg2://{user}:{pw}@localhost/{db}"
                    .format(user='cory', pw=pgpassword, db="lab7"))

In [378]:
works.to_sql('works', con = engine, index=False, chunksize=1000, if_exists='replace')
characters.to_sql('characters', con = engine, index=False, chunksize=1000, if_exists='replace')
chapters.to_sql('chapters', con = engine, index=False, chunksize=1000, if_exists='replace')
paragraphs.to_sql('paragraphs', con = engine, index=False, chunksize=1000, if_exists='replace')

In [379]:
cursor = lab7.cursor()

In [380]:
cursor.execute("SELECT * FROM works")
reviews_df = cursor.fetchall()
colnames = [x[0] for x in cursor.description]
pd.DataFrame(reviews_df, columns=colnames)

,workid,title,longtitle,date,genretype,notes,source,totalwords,totalparagraphs
0,12night,Twelfth Night,"Twelfth Night, Or What You Will",1599,c,None,Moby,19837,1031
1,allswell,All's Well That Ends Well,All's Well That Ends Well,1602,c,None,Moby,22997,1025
2,antonycleo,Antony and Cleopatra,Antony and Cleopatra,1606,t,None,Moby,24905,1344
3,asyoulikeit,As You Like It,As You Like It,1599,c,None,Gutenberg,21690,872
4,comedyerrors,Comedy of Errors,The Comedy of Errors,1589,c,None,Moby,14692,661
5,coriolanus,Coriolanus,Coriolanus,1607,t,None,Moby,27577,1226
6,cymbeline,Cymbeline,"Cymbeline, King of Britain",1609,h,None,Moby,27565,971
7,hamlet,Hamlet,"Tragedy of Hamlet, Prince of Denmark, The",1600,t,None,Gutenberg,30558,1275
8,henry4p1,"Henry IV, Part I","History of Henry IV, Part I",1597,h,None,Moby,24579,884
9,henry4p2,"Henry IV, Part II","History of Henry IV, Part II",1597,h,None,Gutenberg,25692,1013
10,henry5,Henry V,History of Henry V,1598,h,None,Moby,26119,846
11,henry6p1,"Henry VI, Part I","History of Henry VI, Part I",1591,h,None,Moby,21575,772
12,henry6p2,"Henry VI, Part II","History of Henry VI, Part II",1590,h,None,Moby,25411,904
13,henry6p3,"Henry VI, Part III","History of Henry VI, Part III",1590,h,None,Moby,24284,935
14,henry8,Henry VIII,History of Henry VIII,1612,h,None,Moby,24629,779
15,juliuscaesar,Julius Caesar,The Tragedy of Julius Caesar,1599,t,None,Moby,19703,888
16,kingjohn,King John,History of King John,1596,h,None,Moby,20760,615
17,kinglear,King Lear,The Tragedy of King Lear,1605,t,None,Gutenberg,26119,1177
18,loverscomplaint,Lover's Complaint,A Lover's Complaint,1609,p,None,Moby,2559,47
19,loveslabours,Love's Labour's Lost,Love's Labour's Lost,1594,c,None,Moby,21450,1120
20,macbeth,Macbeth,The Tragedy of Macbeth,1605,t,None,Moby,17121,758
21,measure,Measure for Measure,Measure for Measure,1604,c,None,Moby,21773,980
22,merchantvenice,Merchant of Venice,"Merchant of Venice, The",1596,c,None,Moby,21291,718
23,merrywives,Merry Wives of Windsor,"Merry Wives of Windsor, The",1600,c,None,Moby,21845,1161
24,midsummer,Midsummer Night's Dream,A Midsummer Night's Dream,1595,c,None,Moby,16511,603
25,muchado,Much Ado about Nothing,Much Ado about Nothing,1598,c,None,Moby,21157,1059
26,othello,Othello,"The Tragedy of Othello, Moor of Venice",1604,t,None,Moby,26450,1308
27,passionatepilgrim,Passionate Pilgrim,The Passionate Pilgrim,1598,p,None,Moby,3124,43
28,pericles,Pericles,"Pericles, Prince of Tyre",1608,h,None,Moby,18529,748
29,phoenixturtle,Phoenix and the Turtle,The Phoenix and the Turtle,1601,p,None,Moby,353,19
30,rapelucrece,Rape of Lucrece,The Rape of Lucrece,1594,p,None,Moby,15003,269
31,richard2,Richard II,History of Richard II,1595,h,None,Moby,22411,628
32,richard3,Richard III,History of Richard III,1592,h,None,Moby,29278,1210
33,romeojuliet,Romeo and Juliet,The Tragedy of Romeo and Juliet,1594,t,None,Moby,24553,989
34,sonnets,Sonnets,Sonnets,1609,s,None,Moby,17515,154
35,tamingshrew,Taming of the Shrew,The Taming of the Shrew,1593,c,None,Gutenberg,21055,965
36,tempest,Tempest,The Tempest,1611,c,None,Moby,16628,698
37,timonathens,Timon of Athens,The Tragedy of Timon of Athens,1607,t,None,Moby,18206,865
38,titus,Titus Andronicus,Titus Andronicus,1593,t,None,Moby,20710,654
39,troilus,Troilus and Cressida,Troilus and Cressida,1601,t,None,Moby,26089,1295
40,twogents,Two Gentlemen of Verona,Two Gentlemen of Verona,1594,c,None,Moby,17129,943
41,venusadonis,Venus and Adonis,Venus and Adonis,1593,p,None,Moby,9870,201
42,winterstale,The Winter's Tale,The Winter's Tale,1610,c,None,Moby,24914,812

#### Part b
Write a query to display `title`, `date`, and `totalwords` from the `works` table. Rename `date` to `year`, and sort the output by `totalwords` in descending order. Also create a new column called `era` which is equal to "early" for works created before 1600, "middle" for works created between 1600 and 1607, and "late" for works created after 1607. Finally, display only the 7th through 11th rows of the output data. [1 point]

In [381]:
myquery_1_part_b="""
SELECT title, date as year, totalwords, CASE
    WHEN date < 1600 THEN 'early'
    WHEN date BETWEEN 1600 AND 1607 THEN 'middle'
    WHEN date > 1607 THEN 'late'
    ELSE NULL
    END AS era
FROM works
ORDER BY totalwords DESC;
"""

In [382]:
pd.read_sql_query(myquery_1_part_b, con=engine)[7:12]

                   title  year  totalwords     era
7   Troilus and Cressida  1601       26089  middle
8      Henry IV, Part II  1597       25692   early
9      Henry VI, Part II  1590       25411   early
10     The Winter's Tale  1610       24914    late
11  Antony and Cleopatra  1606       24905  middle

#### Part c
The `genretype` column in the "works" table designates five types of Shakespearean work:

* `t` is a tragedy, such as *Romeo and Juliet* and *Hamlet*
* `c` is a comedy, such as *A Midsummer Night's Dream* and *As You Like It*
* `h` is a history, such as *Henry V* and *Richard III*
* `s` refers to Shakespeare's sonnets
* `p` is a narrative (non-sonnet) poem, such as *Venus and Adonis* and *Passionate Pilgrim*

Write a query that generates a table that reports the average number of words in Shakepeare's works by genre type. Display the genre type and the average wordcount within genre, use appropriate aliases, and sort by the average in descending order. [1 point]

In [383]:
myquery="""
SELECT w.genretype,
    AVG(totalwords) AS average
FROM works w
GROUP BY w.genretype
ORDER BY average DESC;
"""
pd.read_sql_query(myquery, con=engine)

  genretype       average
0         h  24236.000000
1         t  23817.363636
2         c  20212.071429
3         s  17515.000000
4         p   6181.800000

#### Part d
Use a query to generate a table that contains the text of Hamlet's (the character, not just the play) longest speech, and use the `print()` function to display this text. [1 point]

In [400]:
myquery="""
SELECT p.plaintext, p.charcount 
FROM paragraphs p
INNER JOIN characters char
    ON p.charid = char.charid
    WHERE charname = 'Hamlet' 
    AND charcount > 0
ORDER BY charcount DESC;
"""
h_speech = pd.read_sql_query(myquery, con=engine)
print(h_speech['plaintext'][0])

Ay, so, God b' wi' ye!                        [Exeunt Rosencrantz and Guildenstern
[p]Now I am alone.
[p]O what a rogue and peasant slave am I!
[p]Is it not monstrous that this player here,
[p]But in a fiction, in a dream of passion,
[p]Could force his soul so to his own conceit
[p]That, from her working, all his visage wann'd,
[p]Tears in his eyes, distraction in's aspect,
[p]A broken voice, and his whole function suiting
[p]With forms to his conceit? And all for nothing!
[p]For Hecuba!
[p]What's Hecuba to him, or he to Hecuba,
[p]That he should weep for her? What would he do,
[p]Had he the motive and the cue for passion
[p]That I have? He would drown the stage with tears
[p]And cleave the general ear with horrid speech;
[p]Make mad the guilty and appal the free,
[p]Confound the ignorant, and amaze indeed
[p]The very faculties of eyes and ears.
[p]Yet I,
[p]A dull and muddy-mettled rascal, peak
[p]Like John-a-dreams, unpregnant of my cause,
[p]And can say nothing! No, not for a king,
[p]Upon whose property and most dear life
[p]A damn'd defeat was made. Am I a coward?
[p]Who calls me villain? breaks my pate across?
[p]Plucks off my beard and blows it in my face?
[p]Tweaks me by th' nose? gives me the lie i' th' throat
[p]As deep as to the lungs? Who does me this, ha?
[p]'Swounds, I should take it! for it cannot be
[p]But I am pigeon-liver'd and lack gall
[p]To make oppression bitter, or ere this
[p]I should have fatted all the region kites
[p]With this slave's offal. Bloody bawdy villain!
[p]Remorseless, treacherous, lecherous, kindless villain!
[p]O, vengeance!
[p]Why, what an ass am I! This is most brave,
[p]That I, the son of a dear father murther'd,
[p]Prompted to my revenge by heaven and hell,
[p]Must (like a whore) unpack my heart with words
[p]And fall a-cursing like a very drab,
[p]A scullion!
[p]Fie upon't! foh! About, my brain! Hum, I have heard
[p]That guilty creatures, sitting at a play,
[p]Have by the very cunning of the scene
[p]Been struck so to the soul that presently
[p]They have proclaim'd their malefactions;
[p]For murther, though it have no tongue, will speak
[p]With most miraculous organ, I'll have these Players
[p]Play something like the murther of my father
[p]Before mine uncle. I'll observe his looks;
[p]I'll tent him to the quick. If he but blench,
[p]I know my course. The spirit that I have seen
[p]May be a devil; and the devil hath power
[p]T' assume a pleasing shape; yea, and perhaps
[p]Out of my weakness and my melancholy,
[p]As he is very potent with such spirits,
[p]Abuses me to damn me. I'll have grounds
[p]More relative than this. The play's the thing
[p]Wherein I'll catch the conscience of the King. Exit.

### Part e
Many scenes in Shakespeare's works take place in palaces or castles. Use a query to create a table that lists all of the chapters that take place in a palace. Include the work's title, the section (renamed to "act"), the chapter (renamed to "scene"), and the description of these chapters. The setting of each scene is listed in the `description` column of the "chapters" table. [Hint: be sure to account for case sensitivity] [2 points]

In [421]:
myquery="""
SELECT title, c.description, c.section as act, c.chapter as scene 
from chapters c
    INNER JOIN works w
    on c.workid = w.workid
WHERE LOWER(description) LIKE '%%palace%%';
"""

In [422]:
pd.read_sql_query(myquery, con=engine)

,title,description,act,scene
0,Twelfth Night,DUKE ORSINO's palace.,2.0,4.0
1,Twelfth Night,DUKE ORSINO's palace.,1.0,4.0
2,Twelfth Night,DUKE ORSINO's palace.,1.0,1.0
3,All's Well That Ends Well,Rousillon. The COUNT's palace.,5.0,3.0
4,All's Well That Ends Well,Rousillon. Before the COUNT's palace.,5.0,2.0
...,...,...,...,...
120,The Winter's Tale,A room in LEONTES' palace.,5.0,1.0
121,The Winter's Tale,Bohemia. The palace of POLIXENES.,4.0,2.0
122,The Winter's Tale,A room in LEONTES' palace.,2.0,3.0
123,The Winter's Tale,A room in LEONTES' palace.,2.0,1.0
124,The Winter's Tale,Antechamber in LEONTES' palace.,1.0,1.0

### Part f
Create a table that lists characters, the plays that the characters appear in, the number of speeches the character gives, and the average length of the speeches that the character gives. Display the character description and the work title, not the ID values. Sort the table by average speech length, and restrict the table to only those characters that give at least 20 speeches. [Hint: you will need to use a subquery.] [2 points]

In [423]:
myquery="""
SELECT description, workid, section as act, chapter as scene 
from chapters c
WHERE LOWER(description) NOT LIKE '%%palace%%' and LOWER(description) NOT LIKE '%%castle%%';
"""
pd.read_sql_query(myquery, con=engine)

                                 description       workid  act  scene
0                             The sea-coast.      12night  1.0    2.0
1                            OLIVIA'S house.      12night  1.0    3.0
2                            OLIVIA'S house.      12night  1.0    5.0
3                             The sea-coast.      12night  2.0    1.0
4                                  A street.      12night  2.0    2.0
..                                       ...          ...  ...    ...
754  Bohemia. A desert country near the sea.  winterstale  3.0    3.0
755                   Chorus as Time speaks.  winterstale  4.0    1.0
756      A road near the Shepherd's cottage.  winterstale  4.0    3.0
757                  The Shepherd's cottage.  winterstale  4.0    4.0
758             A chapel in PAULINA'S house.  winterstale  5.0    3.0

[759 rows x 4 columns]

### Part g
Which Shakepearean works do not contain any scenes in a palace or a castle? Use a query that displays the title, genre type, and publication date of works that do not contain any scenes that take place in a palace or castle. [Hint: use your work in part e as a starting point. You will need a subquery, and you will need to think carefully about the type of join that you need to perform.][2 points]

In [457]:
myquery="""
SELECT w.title, w.date, w.genretype FROM works w
INNER JOIN ( SELECT ch.workid, ch.description, CASE
    WHEN LOWER(ch.description) 
        LIKE '%%palace%%' 
        OR LOWER(ch.description) LIKE '%%castle%%' THEN 1 ELSE 0 END AS count
    FROM chapters ch) b
        ON w.workid = b.workid;
"""

data = pd.read_sql_query(myquery, con=engine)
data.drop_duplicates()

                         title  date genretype
0                Twelfth Night  1599         c
18   All's Well That Ends Well  1602         c
41        Antony and Cleopatra  1606         t
83              As You Like It  1599         c
105           Comedy of Errors  1589         c
116                 Coriolanus  1607         t
144                  Cymbeline  1609         h
171                     Hamlet  1600         t
191           Henry IV, Part I  1597         h
210          Henry IV, Part II  1597         h
230                    Henry V  1598         h
258           Henry VI, Part I  1591         h
285          Henry VI, Part II  1590         h
309         Henry VI, Part III  1590         h
337                 Henry VIII  1612         h
355              Julius Caesar  1599         t
373                  King John  1596         h
389                  King Lear  1605         t
415          Lover's Complaint  1609         p
416       Love's Labour's Lost  1594         c
425                    Macbeth  1605         t
453        Measure for Measure  1604         c
470         Merchant of Venice  1596         c
490     Merry Wives of Windsor  1600         c
513    Midsummer Night's Dream  1595         c
522     Much Ado about Nothing  1598         c
539                    Othello  1604         t
554         Passionate Pilgrim  1598         p
575                   Pericles  1608         h
601     Phoenix and the Turtle  1601         p
602            Rape of Lucrece  1594         p
605                 Richard II  1595         h
624                Richard III  1592         h
649           Romeo and Juliet  1594         t
675                    Sonnets  1609         s
829        Taming of the Shrew  1593         c
843                    Tempest  1611         c
852            Timon of Athens  1607         t
869           Titus Andronicus  1593         t
883       Troilus and Cressida  1601         t
908    Two Gentlemen of Verona  1594         c
928           Venus and Adonis  1593         p
930          The Winter's Tale  1610         c

### Problem 2
The following file contains JSON formatted data of the official English-language translations of every constitution currently in effect in the world:

In [191]:
const = requests.get("https://github.com/jkropko/DS-6001/raw/master/localdata/const.json")
const_json = json.loads(const.text)
pd.DataFrame.from_records(const_json)

,text,country,adopted,revised,reinstated,democracy
0,'Afghanistan 2004 Preamble \nIn the na...,Afghanistan,2004,NaN,NaN,0.372201
1,'Albania 1998 (rev. 2012) Preamble \nWe...,Albania,1998,2012.0,NaN,0.535111
2,'Andorra 1993 Preamble \nThe Andorran P...,Andorra,1993,NaN,NaN,NaN
3,"'Angola 2010 Preamble \nWe, the people ...",Angola,2010,NaN,NaN,0.315043
4,'Antigua and Barbuda 1981 Preamble \nWH...,Antigua and Barbuda,1981,NaN,NaN,NaN
...,...,...,...,...,...,...
140,'Uzbekistan 1992 (rev. 2011) Preamble \...,Uzbekistan,1992,2011.0,NaN,0.195932
141,'Viet Nam 1992 (rev. 2013) Preamble \nI...,Viet Nam,1992,2013.0,NaN,0.251461
142,'Yemen 1991 (rev. 2001) PART ONE. THE FOUN...,Yemen,1991,2001.0,NaN,0.125708
143,"'Zambia 1991 (rev. 2009) Preamble \nWE,...",Zambia,1991,2009.0,NaN,0.405497
144,'Zimbabwe 2013 Preamble \nWe the people...,Zimbabwe,2013,NaN,NaN,0.315359

In [226]:
english = pd.DataFrame.from_records(const_json)
english.to_excel(r'english.xlsx', index = False)

The text of the constitutions are available from the [Wolfram Data Repository](https://datarepository.wolframcloud.com/resources/World-Constitutions). I also included scores that represent the level of democractic quality in each country as of 2016. These scores are compiled by the [Varieties of Democracy (V-Dem)](https://www.v-dem.net/en/) project. Higher scores indicate greater levels of democratic openness and competition.

#### Part a
Connect to your local MongoDB server and create a new collection for the constitution data. Use `.delete_many({})` to remove any existing data from this collection, and insert the data in `const_json` into this collection. [2 points]

In [460]:
import pymongo
from bson.json_util import dumps, loads

In [461]:
myclient = pymongo.MongoClient("mongodb://localhost/")
df_question_2 = myclient["df_question_2"]

In [462]:
df_question_2collection = df_question_2["df_question_2collection"]

In [463]:
df_question_2collection.delete_many({})

In [464]:
df_question_2collection.insert_many(const_json)

#### Part b
Use MongoDB queries and the `dumps()` and `loads()` functions from the `bson` package to produce dataframes with the following restrictions:

* The country, adoption year, and democracy features (and not `_id`, text, revised, or reinstated) for countries with constitutions that were written after 1990 
* The country, adoption year, and democracy features (and not `_id`, text, revised, or reinstated) for countries with constitutions that were written after 1990 AND have a democracy score of less than 0.5
* The country, adoption year, and democracy features (and not `_id`, text, revised, or reinstated) for countries with constitutions that were written after 1990 OR have a democracy score of less than 0.5

[1 point]

* The country, adoption year, and democracy features (and not `_id`, text, revised, or reinstated) for countries with constitutions that were written after 1990

In [465]:
cursor = df_question_2collection.find({'adopted': {'$gt': 1990}}, 
                             {'_id': 0, 'country': 1, 'adopted': 1, 'democracy': 1})
qtext = dumps(cursor)
qrec = loads(qtext)
pd.DataFrame.from_records(qrec)

        country  adopted  democracy
0   Afghanistan     2004   0.372201
1       Albania     1998   0.535111
2       Andorra     1993        NaN
3        Angola     2010   0.315043
4       Armenia     1995   0.393278
..          ...      ...        ...
66   Uzbekistan     1992   0.195932
67     Viet Nam     1992   0.251461
68        Yemen     1991   0.125708
69       Zambia     1991   0.405497
70     Zimbabwe     2013   0.315359

[71 rows x 3 columns]

* The country, adoption year, and democracy features (and not `_id`, text, revised, or reinstated) for countries with constitutions that were written after 1990 AND have a democracy score of less than 0.5

In [466]:
cursor = df_question_2collection.find({'$and': [{'adopted': {'$gt': 1990}}, 
                                                {'democracy': {'$lt': 0.5}}]}, 
                             {'_id': 0, 'country': 1, 'adopted': 1, 'democracy': 1 })
qtext = dumps(cursor)
qrec = loads(qtext)
pd.DataFrame.from_records(qrec)

                             country  adopted  democracy
0                        Afghanistan     2004   0.372201
1                             Angola     2010   0.315043
2                            Armenia     1995   0.393278
3                            Belarus     1994   0.289968
4             Bosnia and Herzegovina     1995   0.338267
5                           Cambodia     1993   0.313738
6                              Egypt     2014   0.218600
7                  Equatorial Guinea     1991   0.217861
8                            Eritrea     1997   0.075621
9                           Ethiopia     1994   0.254865
10                              Fiji     2013   0.473559
11                            Gambia     1996   0.348132
12                              Iraq     2005   0.455402
13                        Kazakhstan     1995   0.262596
14  Lao People's Democratic Republic     1991   0.094434
15                             Libya     2011   0.294716
16                          Maldives     2008   0.386754
17                        Montenegro     2007   0.455338
18                           Myanmar     2008   0.405772
19                              Oman     1996   0.191211
20                Russian Federation     1993   0.275516
21                            Rwanda     2003   0.274476
22                      Saudi Arabia     1992   0.024049
23                            Serbia     2006   0.474443
24                           Somalia     2012   0.177772
25                       South Sudan     2011   0.183267
26                             Sudan     2005   0.311799
27                         Swaziland     2005   0.136008
28              Syrian Arab Republic     2012   0.148212
29                      Turkmenistan     2008   0.154887
30                            Uganda     1995   0.338308
31                           Ukraine     1996   0.361911
32                        Uzbekistan     1992   0.195932
33                          Viet Nam     1992   0.251461
34                             Yemen     1991   0.125708
35                            Zambia     1991   0.405497
36                          Zimbabwe     2013   0.315359

* The country, adoption year, and democracy features (and not `_id`, text, revised, or reinstated) for countries with constitutions that were written after 1990 OR have a democracy score of less than 0.5

In [467]:
cursor = df_question_2collection.find({'$or': [{'adopted': {'$gt': 1990}}, 
                                               {'democracy': {'$lt': 0.5}}]}, 
                             {'_id': 0, 'country': 1, 'adopted': 1, 'democracy': 1})
qtext = dumps(cursor)
qrec = loads(qtext)
pd.DataFrame.from_records(qrec)

        country  adopted  democracy
0   Afghanistan     2004   0.372201
1       Albania     1998   0.535111
2       Andorra     1993        NaN
3        Angola     2010   0.315043
4       Armenia     1995   0.393278
..          ...      ...        ...
78   Uzbekistan     1992   0.195932
79     Viet Nam     1992   0.251461
80        Yemen     1991   0.125708
81       Zambia     1991   0.405497
82     Zimbabwe     2013   0.315359

[83 rows x 3 columns]

#### Part c
According to the Varieties of Democracy project, [Hungary has become less democratic](https://www.v-dem.net/en/news/democratic-declines-hungary/) over the last few years, and can no longer be considered a democracy. Update the record for Hungary to set the democracy score at 0.4. Then query the database to extract the record for Hungary and display the data in a dataframe. [1 point]

In [468]:
df_question_2collection.update_one({'country': 'Hungary'},
                     {'$set' : {'democracy': 0.4}})

In [469]:
mongo_read_query(df_question_2collection, {'country': 'Hungary'})

,_id,text,country,adopted,revised,reinstated,democracy
0,5f8a2692eb4d646956f0c970,'Hungary 2011 (rev. 2013) Preamble \nGo...,Hungary,2011,2013.0,None,0.4

#### Part d
Set the `text` field in the database as a text index. Then query the database to find all constitutions that contain the exact phrase "freedom of speech". Display the country name, adoption year, and democracy scores in a dataframe for the constitutions that match this query. [2 points]

In [471]:
df_question_2collection.drop_indexes()

In [472]:
df_question_2collection.create_index([('text', 'text')])

'text_text'

In [476]:
df = mongo_read_query(df_question_2collection, {'$text': {'$search':'\"freedom of speech\"', '$caseSensitive': False}})
df[['country', 'adopted','democracy']]

                                        country  adopted  democracy
0                                      Slovenia     1991   0.861380
1                                        Poland     1997   0.682208
2                                       Eritrea     1997   0.075621
3                                       Croatia     1991   0.710922
4   Macedonia (The former Yugoslav Republic of)     1991   0.510983
5                                    Kazakhstan     1995   0.262596
6                                      Zimbabwe     2013   0.315359
7                                         Kenya     2010   0.531911
8                                          Fiji     2013   0.473559
9                                       Finland     1999   0.856265
10                                      Georgia     1995   0.757486
11                                      Namibia     1990   0.745421
12                                        Spain     1978   0.834466
13                          Korea (Republic of)     1948   0.757692
14                          Antigua and Barbuda     1981        NaN
15             Saint Vincent and the Grenadines     1979        NaN
16                                     Dominica     1978        NaN
17                                    Swaziland     2005   0.136008
18                                        Ghana     1992   0.670849
19                                       Gambia     1996   0.348132
20                                         Peru     1993   0.730816
21                                       Rwanda     2003   0.274476
22                             Papua New Guinea     1975   0.488884
23                                 Sierra Leone     1991   0.564657
24                                       Belize     1981        NaN
25                                      Hungary     2011   0.400000
26                                   Seychelles     1993   0.589139
27                                        China     1982   0.096066
28                        Saint Kitts and Nevis     1983        NaN
29                                       Uganda     1995   0.338308
30                                   Bangladesh     1972   0.369978
31                                      Somalia     2012   0.177772
32                                 South Africa     1996   0.727070
33                          Trinidad and Tobago     1976   0.730927
34                                       Jordan     1952   0.270614
35                                        Samoa     1962        NaN
36                                    Sri Lanka     1978   0.647035
37                                      Liberia     1986   0.629972
38                                       Mexico     1917   0.672567
39             Lao People's Democratic Republic     1991   0.094434
40                                     Pakistan     1973   0.430273
41                                        India     1949   0.632527
42                                      Myanmar     2008   0.405772
43                                       Bhutan     2008   0.537041
44      Korea (Democratic People's Republic of)     1972   0.090438
45                                  Philippines     1987   0.567393
46                                        Tonga     1875        NaN
47                             Marshall Islands     1979        NaN
48                                       Cyprus     1960   0.810509
49                                    Singapore     1963   0.446464
50                                     Malaysia     1957   0.345091
51                     United States of America     1789   0.849155

#### Part e
Use a query to search for the terms "freedom", "liberty", "legal", "justice", and "rights". Generate a text score for all of the countries, and display the data for the countries with the top 10 relevancy scores in a dataframe. [2 points]

In [474]:
cursor = df_question_2collection.find({'$text': {'$search': 'freedom liberty legal justice rights'}}, {'score': {'$meta': 'textScore'}})
cursor.sort([('score', {'$meta': 'textScore'})]) 
qtext = dumps(cursor)
qrec = loads(qtext)
df = pd.DataFrame.from_records(qrec)
df.head(10)

,_id,text,country,adopted,revised,reinstated,democracy,score
0,5f8a2692eb4d646956f0c9af,'Serbia 2006 Preamble \nConsidering the...,Serbia,2006,NaN,NaN,0.474443,5.030999
1,5f8a2692eb4d646956f0c967,'Finland 1999 (rev. 2011) Chapter 1. Funda...,Finland,1999,2011.0,NaN,0.856265,5.029000
2,5f8a2692eb4d646956f0c964,'Estonia 1992 (rev. 2011) Preamble \nWi...,Estonia,1992,2011.0,NaN,0.909233,5.024473
3,5f8a2692eb4d646956f0c943,'Armenia 1995 (rev. 2005) Preamble \nTh...,Armenia,1995,2005.0,NaN,0.393278,5.023651
4,5f8a2692eb4d646956f0c93f,'Albania 1998 (rev. 2012) Preamble \nWe...,Albania,1998,2012.0,NaN,0.535111,5.023087
5,5f8a2692eb4d646956f0c95e,"'Dominican Republic 2015 Preamble \nWe,...",Dominican Republic,2015,NaN,NaN,0.583654,5.019910
6,5f8a2692eb4d646956f0c992,'Moldova (Republic of) 1994 (rev. 2006) Pr...,Moldova (Republic of),1994,2006.0,NaN,0.571357,5.017063
7,5f8a2692eb4d646956f0c961,'El Salvador 1983 (rev. 2014) TITLE I ...,El Salvador,1983,2014.0,NaN,0.661989,5.016899
8,5f8a2692eb4d646956f0c96a,'Georgia 1995 (rev. 2013) Preamble \nWe...,Georgia,1995,2013.0,NaN,0.757486,5.015282
9,5f8a2692eb4d646956f0c9c3,'Turkey 1982 (rev. 2011) Preamble \nAff...,Turkey,1982,2011.0,NaN,0.341745,5.014672

### Question 3
Close the connections to the PostgreSQL and MongoDB databases. [1 point]

In [475]:
dbserver.close()
myclient.close()